In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
ser1 = Series([2,np.nan,4,np.nan,6,np.nan],
                index=['Q','R','S','T','U','V'])
ser1

Q     2
R   NaN
S     4
T   NaN
U     6
V   NaN
dtype: float64

In [4]:
ser2 = Series(np.arange(len(ser1)),dtype=np.float64,
             index=['Q','R','S','T','U','V'])

In [5]:
ser2

Q    0
R    1
S    2
T    3
U    4
V    5
dtype: float64

In [6]:
# where is the ser1 value is null ,put into ser2 value,if not null then just put ser1
Series(np.where(pd.isnull(ser1),ser2,ser1),index=ser1.index)

Q    2
R    1
S    4
T    3
U    6
V    5
dtype: float64

In [7]:
ser1.combine_first(ser2)

Q    2
R    1
S    4
T    3
U    6
V    5
dtype: float64

In [11]:
nan = np.nan
dframe_odds = DataFrame({'X':[1.,nan,3.,nan],
                        'Y':[nan,5.,nan,7.],
                        'Z':[nan,9.,nan,11.]})

In [10]:
dframe_evens = DataFrame({'X':[2.,4.,nan,6.,8.],
                        'Y':[nan,10.,12.,14.,16.]})

In [12]:
dframe2_odds

NameError: name 'dframe2_odds' is not defined

In [13]:
dframe_odds

    X   Y   Z
0   1 NaN NaN
1 NaN   5   9
2   3 NaN NaN
3 NaN   7  11

In [14]:
dframe_evens

    X   Y
0   2 NaN
1   4  10
2 NaN  12
3   6  14
4   8  16

In [15]:
# switch the NAN value in dframe_odd if the it is in the even position
dframe_odds.combine_first(dframe_evens)

   X   Y   Z
0  1 NaN NaN
1  4   5   9
2  3  12 NaN
3  6   7  11
4  8  16 NaN